In [1]:
import pandas as pd

In [2]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [4]:
departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [14]:
pd.merge(employees, departments, on="DeptID") # Inner join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [9]:
pd.merge(employees, departments, on="DeptID", how="left") # Left join

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [12]:
pd.merge(employees, departments,  on="DeptID",how="right") # Right join

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [25]:
pd.merge(employees, departments, on="DeptID", how="outer") # Outer join prints everything

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [27]:
### Concatenation 

df1 = pd.DataFrame(
    {"name": ["Mayur", "Suraj"], 
      "age": [21, 22]}
)
df1

    name  age
0  Mayur   21
1  Suraj   22

In [28]:
df2 = pd.DataFrame(
    {"name": ["Vishwas", "varun"], 
    "class": ["A", "B"]})
df2

      name class
0  Vishwas     A
1    varun     B

In [18]:
pd.concat([df1, df2])  #axis=0

      name   age class
0    Mayur  21.0   NaN
1    Suraj  22.0   NaN
0  Vishwas   NaN     A
1    varun   NaN     B

In [20]:
pd.concat([df1, df2], axis=1,)  #axis=1 It gives seprate dataframe

    name  age     name class
0  Mayur   21  Vishwas     A
1  Suraj   22    varun     B